{
  "Apple___Apple_scab": "Apple Scab is a fungal disease caused by Venturia inaequalis. It appears as dark, olive-green to black velvety spots on the leaves, fruit, and sometimes young shoots. Infected apples may become deformed or cracked, reducing their quality and market value. The disease thrives in cool, wet conditions, especially in spring.",
  "Apple___Black_rot": "Black Rot is a fungal disease of apples caused by Botryosphaeria obtusa. It causes dark, sunken lesions on fruit, often with concentric rings, and can lead to fruit mummification. Leaves may show small, purple spots that enlarge with tan centers, and bark can develop cankers. The disease spreads in warm, humid conditions, especially after rain.",
  "Apple___Cedar_apple_rust": "Cedar Apple Rust is a fungal disease caused by Gymnosporangium juniperi-virginianae. It creates bright orange or yellow spots on apple leaves and fruit, often with a red border. Severe infections can cause leaf drop and reduce fruit quality. The fungus requires both apple and cedar (juniper) trees to complete its life cycle, spreading in wet spring conditions.",
  "Apple___healthy": "Healthy Leaf.",
  "Blueberry___healthy": "Healthy Leaf.",
  "Cherry___healthy": "Healthy Leaf.",
  "Cherry___Powdery_mildew": "Powdery Mildew on cherry is a fungal disease caused by Podosphaera clandestina. It appears as a white, powdery coating on leaves, shoots, and sometimes fruit. Infected leaves may become distorted, curled, or drop early, and fruit growth can be stunted. The disease thrives in warm, dry climates with high humidity, especially in late spring and summer.",
  "Corn___Cercospora_leaf_spot Gray_leaf_spot":"Corn Cercospora Leaf Spot (Gray Leaf Spot) is a fungal disease in corn caused mainly by Cercospora zeae-maydis. It produces elongated, gray to tan lesions on leaves with dark borders, which can merge and cause large areas of dead tissue. Severe infections reduce photosynthesis, leading to yield loss. The disease spreads in warm, humid conditions, especially with prolonged leaf wetness.",
  "Corn___Common_rust":"Common Rust of corn is a fungal disease caused by Puccinia sorghi. It appears as reddish-brown, oval pustules on both sides of the leaves. As the disease progresses, leaves may yellow and die early, reducing photosynthesis and yield. It thrives in cool, humid weather and spreads via windborne spores.",
  "Corn___healthy":"Healthy Leaf.", 
  "Corn___Northern_Leaf_Blight":"Northern Leaf Blight is a fungal disease of corn caused by Exserohilum turcicum. It produces long, cigar-shaped gray or tan lesions on the leaves, which can merge and cause extensive leaf damage. Severe infections reduce photosynthesis and grain yield. The disease thrives in cool, wet conditions and spreads through infected plant debris and windborne spores.",
  "Grape___Black_rot":"Black Rot of grape is a fungal disease caused by Guignardia bidwellii. It starts as small brown spots on leaves that enlarge with dark margins, and eventually causes black, shriveled (mummified) berries. Infected shoots and tendrils may also show symptoms. The disease spreads rapidly in warm, humid weather and overwinters in infected plant debris.", 
  "Grape___Esca_(Black_Measles)":"Esca (Black Measles) is a fungal disease complex in grapes caused by multiple fungi, including Phaeomoniella chlamydospora and Phaeoacremonium spp.. It causes interveinal yellowing or reddening of leaves, dark streaks in the wood, and sunken, dark lesions on berries (the measles). Infected vines may show sudden wilting and decline. The disease thrives in warm climates and spreads through pruning wounds and infected tools.", 
  "Grape___healthy":"Healthy Leaf.",
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)":"Leaf Blight (Isariopsis Leaf Spot) in grapes is a fungal disease caused by Isariopsis clavispora. It appears as irregular, brown to black spots on leaves, often with a yellow halo. Infected leaves may curl, dry out, and fall prematurely, reducing the plant’s ability to photosynthesize. The disease develops rapidly in warm, humid conditions and can weaken vines if severe.",
  "Orange___Haunglongbing_(Citrus_greening)":"Huanglongbing (Citrus Greening) is a bacterial disease caused by Candidatus Liberibacter species and spread by the Asian citrus psyllid. It causes yellowing of leaves, misshapen and bitter fruit, and overall decline of the tree. Infected trees produce small, green, and bitter oranges that drop prematurely. The disease is fatal and difficult to manage once established.", 
  "Peach___Bacterial_spot":"Bacterial Spot of peach is a bacterial disease caused by Xanthomonas campestris pv. pruni. It causes small, dark, water-soaked spots on leaves, fruit, and twigs. Infected leaves may become yellow and drop early, and fruit spots can lead to cracking and rot. The disease spreads in warm, wet conditions and can reduce fruit quality and yield.", 
  "Peach___healthy":"Healthy Leaf.", 
  "Pepper,_bell___Bacterial_spot":"Bacterial Spot of bell pepper is a bacterial disease caused by Xanthomonas campestris pv. vesicatoria. It produces small, water-soaked, dark lesions on leaves, stems, and fruit. On peppers, spots may become raised and scabby, causing fruit blemishes and drop. The disease spreads rapidly in warm, wet conditions, reducing yield and marketability.",
  "Pepper,_bell___healthy":"Healthy Leaf.",
  "Potato___Early_blight":"Early Blight of potato is a fungal disease caused by Alternaria solani. It causes dark brown spots with concentric rings on older leaves, which can enlarge and lead to leaf yellowing and drop. Infections can also affect stems and tubers, causing rot. The disease thrives in warm, wet conditions and can significantly reduce yield if uncontrolled.", 
  "Potato___healthy":"Healthy Leaf.",
  "Potato___Late_blight":"Late Blight of potato is a serious fungal-like disease caused by Phytophthora infestans. It causes dark, water-soaked lesions on leaves and stems that rapidly enlarge, often with a white fuzzy growth under humid conditions. Tubers can develop firm, brown rot. The disease spreads quickly in cool, wet weather and can devastate crops if not managed promptly.",
  "Raspberry___healthy":"Healthy Leaf.",
  "Soybean___healthy":"Healthy Leaf.", 
  "Squash___Powdery_mildew":"Powdery Mildew on squash is a fungal disease caused by Podosphaera xanthii and Erysiphe cichoracearum. It appears as white, powdery spots on leaves, stems, and sometimes fruit. Infected leaves may yellow, curl, and dry out, reducing photosynthesis and plant vigor. The disease thrives in warm, dry conditions with high humidity.",
  "Strawberry___healthy":"Healthy Leaf.",
  "Strawberry___Leaf_scorch":"Leaf Scorch of strawberry is a bacterial disease caused by Xanthomonas fragariae. It causes small, water-soaked spots on leaves that enlarge into irregular, reddish-brown lesions with yellow halos. Severely infected leaves may wither and die, reducing plant vigor. The disease spreads in wet, humid conditions and can persist in plant debris.", 
  "Tomato___Bacterial_spot":"Bacterial Spot of tomato is a bacterial disease caused by Xanthomonas spp.. It produces small, dark, water-soaked spots on leaves, stems, and fruit. On leaves, spots may merge causing yellowing and defoliation, while fruit lesions lead to scarring and reduced quality. The disease spreads rapidly in warm, wet conditions.",
  "Tomato___Early_blight":"Early Blight of tomato is a fungal disease caused by Alternaria solani. It causes dark, concentric ringed spots on older leaves, stems, and fruit. Infected leaves may yellow and drop prematurely, reducing plant vigor. The disease thrives in warm, wet conditions and can lead to significant yield loss if unmanaged.",
  "Tomato___healthy":"Health Leafy.",
  "Tomato___Late_blight":"Late Blight of tomato is a devastating disease caused by Phytophthora infestans. It produces water-soaked, dark lesions on leaves and stems that rapidly expand, often with white fungal growth under humid conditions. Fruit can develop brown, rotten spots. The disease spreads quickly in cool, wet weather and can cause severe crop loss.",
  "Tomato___Leaf_Mold":"Leaf Mold of tomato is a fungal disease caused by Passalora fulva. It appears as yellow spots on the upper leaf surface and dense, olive-green to gray mold growth on the underside. Infected leaves may curl, dry out, and drop prematurely. The disease thrives in warm, humid, and poorly ventilated conditions.",
  "Tomato___Septoria_leaf_spot":"Septoria Leaf Spot of tomato is a fungal disease caused by Septoria lycopersici. It produces small, round spots with dark borders and grayish centers on lower leaves. Infected leaves yellow, wither, and drop prematurely, weakening the plant. The disease spreads in warm, wet conditions, especially with overhead irrigation.",
  "Tomato___Spider_mites Two-spotted_spider_mite":"Two-Spotted Spider Mite is a tiny arachnid pest that feeds on tomato leaves by piercing cells and sucking out their contents. It causes fine yellow or white speckling on leaves, which may become bronzed, dry, and drop prematurely. Heavy infestations reduce plant vigor and yield. The mites thrive in hot, dry conditions and multiply rapidly.",
  "Tomato___Target_Spot":"Target Spot of tomato is a fungal disease caused by Corynespora cassiicola. It produces large, brown to black spots with concentric rings resembling a target on leaves and fruit. Infected leaves may yellow, wither, and drop prematurely, reducing photosynthesis. The disease thrives in warm, humid conditions and can cause significant yield loss.",
  "Tomato___Tomato_mosaic_virus":"Tomato Mosaic Virus (ToMV) is a viral disease that causes mottled light and dark green patterns, leaf curling, and distorted growth on tomato plants. Infected fruit may be misshapen with uneven ripening. The virus spreads through contaminated tools, hands, and seeds and can reduce yield and fruit quality.",
  "Tomato___Tomato_Yellow_Leaf_Curl_Virus":"Tomato Yellow Leaf Curl Virus (TYLCV) is a viral disease transmitted by the whitefly. It causes yellowing and curling of young leaves, stunted growth, and reduced fruit production. Infected plants often show severe leaf distortion and yield loss. The virus spreads rapidly in warm climates with whitefly presence."
}
